[
	{
		"id" : 1,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2020-12-06 16:46:23",
		"CID" : "cea",
		"CNAME" : "Civil Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "Motto : To impart latest trends in Civil Engineering to our students.\r\nThe Civil Engineering Association functions as a forum for students to organise technical events facilitating interaction with experts from other organisations. ",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 2,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "mea",
		"CNAME" : "Mechanical Engineering Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 3,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2020-12-08 19:19:50",
		"CID" : "eeea",
		"CNAME" : "Electrical & Electronics Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "The EEEA is actively involved in conducting various activities that are aimed to inculcate the technical knowledge, competence, creativity, soft skills among the UG students. The EEEA also organizes various skill development sessions such as workshops, project expos to improve the overall technical exposure of the student community. The association also conducts the intra college event fest, Molecules which attracts students from all the departments of the college, serving as a good catapult to launch talented minds into their colourful career prospects.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 4,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2020-12-30 15:06:05",
		"CID" : "ecea",
		"CNAME" : "Electronics & Communication Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "ECE Association is a platform exclusively for the students of Electronics and Communication Engineering Department which encourages the students in improving oneself both academically, socially and renders utmost support in ensuring students' success. We organize various technical and non-technical events, workshops and seminars for our students throughout the year and their astounding talents are greatly appreciated.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 5,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-02-19 20:17:52",
		"CID" : "metea",
		"CNAME" : "Metallurgical Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "Metallurgical Engineering Association (MTEA) works for the students welfare and develop their knowledge in the field of Metallurgy and Materials Engineering. The association organizes various seminars, guest lectures, workshops and conference based on the interest of the students and recent advancements in the field of metallurgy which help them to scale greater heights. Every year MTEA organizes \"WOOTZ\", a National level technical symposium provides better platform for students to show their skills and talents. MTEA supports young metallurgists of PSG College of Technology which improves the technical stuff and their personality in the academic year.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 6,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "pea",
		"CNAME" : "Production Engineering Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 7,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2020-12-09 23:45:59",
		"CID" : "csea",
		"CNAME" : "Computer Science & Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "CSEA, the disciplinary association for the department of computer science and engineering, stands as a platform to help the students enhance their practical knowledge through various events like group discussions, seminars, workshops and guest lectures. The association also helps the students to improve their technical skills through various competitions throughout the year. ",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 8,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-02-28 23:36:50",
		"CID" : "ttea",
		"CNAME" : "Textile Technology Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "Textile Technology Association (TTA),  a textile students  professional forum , through which the students are exposed to the latest areas of textiles. Workshops and  Award functions  are organized for the benefit of  textile technology students.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 9,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2020-01-13 19:38:50",
		"CID" : "aea",
		"CNAME" : "Automobile Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "AEA is a prestigious forum which provides an opportunity for an exposure on global Automotive Business. It promotes various student activities and makes students highly expertise in engineering acumen. The students of all four years are members of the association. The association is lead by a strong team with students of high managerial skills and leadership qualities. It is guided by a highly experienced faculty of the department of Automobile Engineering. The association aims at improving the students' exposure and knowledge in auto field and promotes intra and inter department activities through a variety of programs. Our association also has very good industrial relationships through which a variety of guest lectures and training programmes are organized in the recent trends in Automotive Engineering to make our students upto date even in the latest of trends. Technical events include paper presentation, quiz, design, drawing contest, etc. and non-technical events include hanging quiz, cross-word etc. During the weekly sessions of AEA, students are exposed to aptitude test, Group Discussions and mock interviews which enables them to improve their communication skills, technical knowledge and face the interviews with improved confidence. Guest lectures and industrial visits to various factories in and around the city of Coimbatore are arranged to offer the students an exposure to the current trends in the industry and latest technologies of automation. The association also arranges special training programmes in different automotive to update the knowledge of the students..",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 10,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "bta",
		"CNAME" : "Biotechnology Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 11,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-20 09:57:46",
		"CID" : "ita",
		"CNAME" : "Information Technology Association",
		"CAT" : "assn",
		"ABOUT" : "Technical Association of Department of Information Technology completely driven by UG students of the department under the guidance of Faculty advisor. Seamlessly and actively working for the development of the department and college and betterment of the students of the department.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 12,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-27 23:05:44",
		"CID" : "bmea",
		"CNAME" : "Biomedical Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "Biomedical Engineering Association foster the students to understand about the market requirements in the field of biomedical engineering, enlighten to the contemporary technologies, interact with the multidisciplinary streams of engineering and empower them to work as a team to attain a common goal. The association so far conducted special lectures, workshops, alumni interactions and various other activities for the betterment of the students.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 13,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-01-13 04:35:58",
		"CID" : "fta",
		"CNAME" : "Fashion Technology Association",
		"CAT" : "assn",
		"ABOUT" : "Motto: To become the center of co-curricular excellence by providing opportunities to the students of fashion technology through continuous improvement and to install the ideal of sense of belongingness of the association in the minds of the students.\r\n\r\nThe Fashion Technology association functions as a forum for the students to organize technical events, facilitating interaction with experts from industry and academia. Students actively assist in organizing national or international conference, seminar, workshops and symposia. Eminent speakers from industry and academia deliver lectures on current trends and provide deeper insight into the global industry.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 14,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-29 03:16:38",
		"CID" : "icea",
		"CNAME" : "Instrumentation & Control Systems Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "ICEA & ISA Students Chapter stands as a platform to enhance the students knowledge through guest lectures, workshops and various events.   \r\n\r\nThe Department of Instrumentation and Control Systems Engineering has Instrumentation and Control Engineering Association (ICEA) and Student Chapter of International Society of Automation (ISA). Activities done by these associations include arranging guest lectures, conduction project competitions and conducting technical symposiums.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 15,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-03-01 22:08:08",
		"CID" : "raea",
		"CNAME" : "Robotics & Automation Engineering Association",
		"CAT" : "assn",
		"ABOUT" : "Motto: \"To develop the inner thirst of the engineering students towards the new technology\"\r\n\r\nThe primary motto of our RAEA is to bring the interest and to develop the knowledge of the students towards the upcoming technologies. It is necessary for the students to develop their problem solving capacity and their interest in the Robotics and Automation Engineering field at the earlier stage so that they can take up many projects and shine in the future. RAEA serve as a great platform for the younger generation.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 16,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "ma",
		"CNAME" : "Management Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 17,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-03-04 00:17:40",
		"CID" : "asa",
		"CNAME" : "Applied Science Association",
		"CAT" : "assn",
		"ABOUT" : "Applied Science Association was found during the academic year 2014-2015. The Association focuses on good exposure towards industrial and research opportunities and scientific aid for the students of Applied Science. As a team, members of Applied Science Association are periodically conducting various technical events, organising guest lectures and alumni interactive sessions and many activities that motivate students to learn.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 18,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-02-27 02:18:47",
		"CID" : "caa",
		"CNAME" : "Computer Applications Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 19,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "csa",
		"CNAME" : "Computational Sciences Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 20,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-01-11 22:12:29",
		"CID" : "ram",
		"CNAME" : "Ramanujan Association of Mathematics",
		"CAT" : "assn",
		"ABOUT" : "Ramanujan Association of Mathematics(RAM) is the renowned association for mathematics in PSG College of Technology. The fundamental objective of the association is to make the students apply mathematics to the pressing problems of the world and apply the engineering knowledge to provide solutions for the problems by abiding the laws of sciences and mathematics. Now, it is one of the most active associations in our college. Events are being conducted under different genre and it includes both math and fun. Students from various departments from various years of study are actively participating in these events and taking the fame of our association throughout the college.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 21,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-31 14:36:52",
		"CID" : "afda",
		"CNAME" : "Apparel & Fashion Design Association",
		"CAT" : "assn",
		"ABOUT" : "Apparel and Fashion Design Association at PSG Tech is an initiative to provide an excellent platform for the Apparel and Fashion Design students to engage in various curricular and co-curricular activities.<br>\r\n<B>Our Mission</B><br>\r\nTo build remarkable multi-disciplinary academic support for students; by inviting eminent personalities of the fashion industry, organizing guest lectures and workshops on diverse topics, and empowering the students to help buildup a career of their choice.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 22,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2020-12-22 21:45:41",
		"CID" : "ie",
		"CNAME" : "Institution of Engineers",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 23,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "asme",
		"CNAME" : "American Society of Mechanical Engineers",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 24,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "sme",
		"CNAME" : "Society of Manufacturing Engineers",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 25,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-02-27 19:04:37",
		"CID" : "ieee",
		"CNAME" : "Institute of Electrical & Electronics Engineering",
		"CAT" : "assn",
		"ABOUT" : "The Students’ Chapter of IEEE at PSG College of Technology was founded in 1974. It was initiated to increase the participation of students in research and encourage new ideas in the respective fields. PSG has always been known to set benchmarks in terms of quality of engineering and is one of the first and foremost institutions to have a Students branch of IEEE. The IEEE Students Chapter of PSG Tech has been actively involved in organizing top notch technical fests every year that has evoked the interest and involvement of students from various parts of the country. It has been the biggest technical Association in PSG College of Technology. \r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 26,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-03-04 02:50:49",
		"CID" : "sae",
		"CNAME" : "Society of Automotive Engineers",
		"CAT" : "assn",
		"ABOUT" : "This club was started in the year 2002. The students of Automobile,Mechanical,Production, ECE and EEE are eligible to become student member of this club. This club organises guest lectures and technical events. The members of this club participated in national level events like BAJA (All Terrain Vehicle design contest), Supra Event and an Efficycle (eco-friendlty  Vehicle design contest). The women members have been awarded with Kalpana Chawla award and SAE Students scholarship award. The club has been appreciated for higher membership strength.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 27,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-31 09:35:45",
		"CID" : "iete",
		"CNAME" : "The Institute of Electronics & Telecommunication Engineers",
		"CAT" : "assn",
		"ABOUT" : "The Institution of Electronics and Telecommunication Engineers is India's leading recognised professional society dedicated to the advancement of Science and Technology of Electronics, Telecommunication & IT. The Government of India has recognised IETE as a Scientific and Industrial Research Organization. The objectives of IETE focus on advancing electro-technology. IETE conducts and sponsors technical meetings, conferences and exhibitions all over India, and provides continuing education as well as career advancement opportunities to its members. Students experience outside-the-classroom studies, practical work, seminars and many more wonderful opportunities.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 28,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-07-08 09:05:54",
		"CID" : "iste",
		"CNAME" : "ISTE",
		"CAT" : "assn",
		"ABOUT" : "The Indian Society for Technical Education (ISTE) is the leading National Professional non-profit making Society for the Technical Education System in our country with the motto of Career Development of Teachers and Personality Development of Students and overall development of our Technical Education System.The team always try to conduct events and lectures to enhance the students activities in various ways",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 29,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-28 04:56:13",
		"CID" : "sesi",
		"CNAME" : "Solar Energy Society of India",
		"CAT" : "assn",
		"ABOUT" : "SESI Students' Chapter of PSG TECH was established to create awareness on renewable energy among the student community. The chapter has created a platform wherein students will interact with field experts and gain knowledge in the latest technologies. This will further help the students to pursue high quality research. The chapter also helps the students to gain practical experience in the renewable energy by connecting with various industries.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 30,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "isa",
		"CNAME" : "International Society of Automation",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 31,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "iiie",
		"CNAME" : "Indian Institution of Industrial Engineering",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 32,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "gsa",
		"CNAME" : "Graduate Students Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 33,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "ishrae",
		"CNAME" : "ISHRAE",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 34,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-02-19 20:49:29",
		"CID" : "iim",
		"CNAME" : "IIM – Students Affiliate Chapter",
		"CAT" : "association",
		"ABOUT" : "The Indian Institute of Metals (IIM), Coimbatore Chapter, started four decades ago, has been organizing lectures, seminars, workshops and conferences on recent trends in the field of Metallurgy and Materials Engineering. The IIM Coimbatore chapter regularly organizes training programs for the young engineers from industries and academic institutions to update their knowledge on metals and materials. In addition, quiz programs on materials and their processing are also being conducted for the students of schools and colleges. ",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 35,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "mas",
		"CNAME" : "Materials Advantage Society",
		"CAT" : "association",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 36,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-01-15 15:58:14",
		"CID" : "cvrpa",
		"CNAME" : "Sir C.V.Raman Physics Association",
		"CAT" : "assn",
		"ABOUT" : "Sir C.V. Raman Physics Association has been one of the renowned and active associations of PSG College of Technology. It provides the students a platform to explore various disciples of physics in depth. The association organizes a wide range of events that quench the knowledge thirst of physics enthusiasts. The events organized range from quizzes, puzzles to webinars and guest lectures which help students to get an insight into the past, present and future of Physics!",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 37,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-26 09:42:43",
		"CID" : "awc",
		"CNAME" : "Animal Welfare Club",
		"CAT" : "club",
		"ABOUT" : "Let's be the voice for the voiceless.\r\nBecause the heart beats under a covering of hair, fur, or feathers, it is for that reason to be of no account? We don't think so and we live by it.\r\nWe at Animal Welfare Club (AWC) are here to add to the essence of humanity. AWC is involved in numerous ventures such as rescues and fostering, having done a lot over 50 rescues, shelter visits and volunteering. To inspirit others, we engage in zoo visits, guest lectures, cleanliness drives, exciting games, and fundraisers.\r\nAWCs most anticipated handprint event on World Animal Day has over 1000 participants every year, making a promise that they would always help any animal in need and never for any reason be a threat to their wellbeing. \r\nHere's why we do it. As citizens of India, we need to bite the bullet and address various issues such as animal cruelty, native breed adoption, irresponsible dog breeding, laboratory testing on animals, ivory trade, poaching and so much more.\r\nWe use the means of art, short films, posters, videos, and events to get the message across.\r\nCompassion for animals is intimately associated with goodness of character. So, join hands with us to make our world a better place for all life calling it their home.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 38,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-02-19 19:37:37",
		"CID" : "astro",
		"CNAME" : "Astronomy Club",
		"CAT" : "club",
		"ABOUT" : "Insomniacs, compelled by man's singular desire to look up in the sky, to understand our significance in the universe, and our insignificance in Nature.\r\nJoin us on our journey to explore the universe through Stargazing, Seminars, Discussions and other fun activities as among PSG Tech's most unique club for astrophiles.\r\n\"Insomniacs, compelled by man's singular desire to look upwards, to understand\r\nour significance in the universe, and our insignificance in Nature.\"\r\nThe Astronomy Club aims to build awareness and inculcate scientific thinking\r\nassociated with the Earth and other celestial objects via several means of engagement\r\nwith the student community at PSG Tech. It stands as one of the older societies in the\r\ninstitute and with the unique distinction of having had world renowned researchers\r\ntaking part in engagements with the members of the club and the student community.\r\nThe students are engaged by various activities such as stargazing, seminars,\r\nastrophotography, discussions and other fun activities.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 39,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-02-19 17:54:37",
		"CID" : "asq",
		"CNAME" : "Association of Serious Quizzers",
		"CAT" : "club",
		"ABOUT" : "ASQ was originated in 2009 where like minded people of PSG Tech came together as participants for quizzes in and out the college. Their meetings evolved into informal quizzes that set the banner for Association of  Serious Quizzers. The main events of ASQ include Freshers quiz where it exclusively conducted for new comers of PSG Tech and the winners will be hosting quiz for their successors. Apart from this we conduct 2 quizzes during Intrams, one general and one entertainment. We also take pride in conducting Kriya Open Quiz every year where quizzers from other colleges too take part. Even this Pandemic couldn’t stop us from our work, We kept engaging the people around us by posting daily questions through our Instagram Handle.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 40,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-15 23:29:48",
		"CID" : "brc",
		"CNAME" : "Book Readers Club",
		"CAT" : "club",
		"ABOUT" : "Every book lover not only loves reading but also analyzing and discussing their thoughts about the book. Perhaps, books are a uniquely portable magic. It is important to read a good book at least for few minutes everyday to stretch the brain muscles for healthy functioning. Book Readers Club acts as a perfect platform for that. The club is open to anyone with a passion for reading and writing books or articles. We offer seminars, discussions, and other fun activities that promote reading habits among Techians. Weekly reading sessions are planned to enrich the intellectual wealth of passionate readers. Further, book reviews offered by our club help readers figure out which book they might want to read next. Interestingly, ardent readers are skillful writers too and accordingly Book Readers Club also sets up a platform to unravel the writing skills of readers. The more that you read, the more things you will know. And the more that you learn, the more places you’ll go.\r\n\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 41,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-31 10:00:44",
		"CID" : "cap",
		"CNAME" : "CAP  Nature Club",
		"CAT" : "club",
		"ABOUT" : "This club is started to emphasize the importance of Nature among the students and to initiate steps to conserve Nature which is the right for all living things in the world. The abbreviation of CAP is “Character and Personality”. The success of any activity or event in the club is entirely based on Club member’s involvement and their contribution. From day one till now, the success of each event was only because of our club members who are the sole support for the club and for us too.  The CAP & Nature club stands unique by making the students participate in all its events which develops their personality and helps to inculcate new ideas in serving the society in all its kinds. The major highlight of the club is the trekking activity which has been followed every year that highly connects the students with nature. Every year the maximum number of students who register for PCD (Personality and Character Development) get benefited by the workshops and guest lectures conducted exclusively for them. The main strength of the club is the support from our Faculty advisors, where they always stand with the office bearers to make every year attain its goal to the fullest. The club with its pride and prestige will serve long and make enormous students benefit both in present and future.  ",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 42,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-07-08 00:55:53",
		"CID" : "dx",
		"CNAME" : "Dramatix Club",
		"CAT" : "club",
		"ABOUT" : "           This academic year 2019-20, started with a college wide recruitment for various categories in the club including dance, acting, set work, cinematography and editing. Our events ‘FOOTLOOSE’, ‘THE MIME SHOW’ and ‘LIGHTS CAMERA ACTION’ were organized as a part of INTRAMS conducted on 22nd September 2019. These were cultural events which showcased the immense talents of our college students. \r\n           The Dramatix show for the odd semester, Curtain Raiser – ‘MISAI’ was planned and executed in a grand and exotic manner. It was on the 13th of October, 2019. The event commenced with the Secretary’s speech which was followed by a series of performances put to show by the club members. There were dance performances by the girls and boys team which kept the audience at the heights of enthusiasm. Skits were performed by the Drama Team. The event highlighted the acting, cinematography and editing skills of our members through a short film and a diverse set of entertaining videos which radiated social messages. The outstanding part of the event was the awe-inspiring work done by the set work team which spotlighted the artistic abilities of our members. The event thus culminated successfully with the timeless work and coordination of our club members....\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 43,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-03-02 02:44:23",
		"CID" : "els",
		"CNAME" : "English Literary Society",
		"CAT" : "club",
		"ABOUT" : "We , at the ELS aim to inculcate the confidence in the minds of our students. To empower them and to teach them to embrace the English language. So that it is no longer an obstacle but a tool that will help them express themselves without doubt.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 44,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-25 11:36:11",
		"CID" : "eclub",
		"CNAME" : "Entrepreneurs Club",
		"CAT" : "club",
		"ABOUT" : "Everything Begins with an Idea! \r\nThe Entrepreneurs Club of PSG College of Technology aims to provide a stage for students to ideate, initiate and invigorate their dreams. The club seeks to instil a strong acumen for leadership, innovation and business qualities in its student community. We serve as an educational and developmental resource by strengthening our ties with existing entrepreneurial groups and providing networking opportunities with thriving ventures.\r\n\r\n​\r\n\r\nStarted in collaboration with the National Entrepreneurship Network (A part of the Wadhwani Foundation) and under the aegis of PSG Science and Technology Entrepreneurial Park in 2006. We are now home to the Net Program under the Young Indians, a part of the Confederation of Indian Industry (CII), run 4 in-house startups and a launchpad for the budding student entrepreneurs. \r\nExplore the diversity and richness of our club and all that it has to offer to develop insightful entrepreneurs to make a difference on a global scale.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 45,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2020-11-29 21:44:48",
		"CID" : "fac",
		"CNAME" : "Fine Arts Club",
		"CAT" : "club",
		"ABOUT" : "            The FINE ARTS CLUB of PSG TECH consists of four different artistically wings namely Drawing and painting, Photography, Multimedia and Philately. This club acts as a platform for unleashing the hidden talents of the students. It is also focused on providing recognition to the talented people. Every year FineArts Club organizes a number of events and competitions which involves both core and fun learning. Our motto is that everyone should enjoy all the wings of the club irrespective of whether they are trained professionals or avid beginners..",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 46,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-02-19 21:56:40",
		"CID" : "glf",
		"CNAME" : "Global Leaders Forum",
		"CAT" : "club",
		"ABOUT" : "Global Leaders’ Forum is one of the most renowned clubs at PSG College of Technology, Coimbatore. GLF, since its inception, has always worked with a holistic approach to mold the leaders of tomorrow. Keeping in mind a global perspective, the forum offers a plethora of activities that are aimed at instilling the spirit of leadership and team work in the students.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 47,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-19 22:21:19",
		"CID" : "hef",
		"CNAME" : "Higher Education Forum",
		"CAT" : "club",
		"ABOUT" : "\"Education is the most powerful weapon which you can use to change the world\" - Nelson Mandela\r\n\r\nThe main goal of education is to create individuals who are capable of doing new things, not simply repeating what other generations have done. We, the HEF Team, aim to create an awareness about various higher study opportunities abroad. The purpose of higher studies and its boon in the future is made known to everyone.\r\n\r\nWe conduct various events, guest lectures, awareness programs, mock tests, video conferences and help the future generations to grow in their life. A perfect guidance for various exams like CAT, GRE, GATE, UPSC  and GMAT are provided to the student community.\r\n\r\nThe ultimate goal of the club is to train and coach the students whose aim is to touch the stars. We provide support and assist them in achieving their dreams. \r\n\r\n✨THINK BEYOND PLACEMENTS✨",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 48,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-12 05:05:08",
		"CID" : "iif",
		"CNAME" : "Industry Interaction Forum",
		"CAT" : "club",
		"ABOUT" : "Industry (alumni) Interaction Forum serves as a platform for the student community in PSG College of Technology to get acquainted with alumni and industries. The forum conducts numerous guest lectures, technical and non-technical events throughout the academic year to prepare students for their careers. The forum attracts influential and inspiring minds to share their life-changing experiences.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 49,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-01-10 18:15:15",
		"CID" : "mac",
		"CNAME" : "Martial Arts Club",
		"CAT" : "club",
		"ABOUT" : "MAC is a club that paves way for students to learn and gain expertise in martial arts. We coach amateurs as well as experts. Also, we help them to take part in tournaments. Currently, we are actively involved in karate, yoga and silambam. We focus on strengthening the students' community. ",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 50,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-23 22:06:53",
		"CID" : "pat",
		"CNAME" : "Paathshala Club",
		"CAT" : "club",
		"ABOUT" : "The PAATHSHALA CLUB of PSG TECH was started with a common goal – to help fellow students learn, understand and speak Hindi. Today, with more than 90 active members, this prestigious club has grown into a large family. Every semester, Paathshala has been successfully conducting two certified workshops - a Beginner and an Advanced level workshop. These workshops aim to develop, nurture and improve the reading, writing and communication skills of the students. Learning Hindi gives the students an upper hand in placements and for higher studies. Paathshala also conducts a number of exciting events for the Intrams, Hindi Divas and Kriya.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 51,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-02-19 21:01:57",
		"CID" : "bridge",
		"CNAME" : "PSG Tech Chronicle Club",
		"CAT" : "club",
		"ABOUT" : "PSG TECH Chronicle Club was formed on 22/02/2019. Chronicle Club is official content provider for the PSG Magazine Harbinger. The students of the club from each department collect the details of all the events that takes place in their department and college. The gathered information are finally drafted and sent as content for Harbinger magazine. The content is provided once in every 3 months. Apart from this, the members of the club group together and conduct some interesting events to give the students an idea of what is happening around them. The Bridge also collaborated and works with us.\r\nFounded on August 15, 2014, THE BRIDGE is the official news body of PSG College of Technology. Named after the iconic structure of PSG Tech, we intend to be the “bridge” that connects the institution to the outside world. We try our best to empower the student community by being their voice, by encouraging writing and other forms of expression and by providing them a form of social presence.\r\nOur presence is mostly online, on our website and on social media - Facebook, Twitter, LinkedIn and Instagram. We try to curate platform-based content (like the People of PSG series) for best engagement of our readers. We also conduct promotional events and workshops on the campus for our readers.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 52,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-02-19 22:30:41",
		"CID" : "rh",
		"CNAME" : "Radio Hub",
		"CAT" : "club",
		"ABOUT" : "Radio Hub is a club for young and adroit students of PSG College of Technology, which is one of the prestigious educational institutions of India, strives to edify the students to enrich the life of the people with knowledge, awareness, and happiness and elevate the level of society, through the easily reachable powerful medium - Radio.\r\nPSG Community Radio is the first and foremost community radio of Coimbatore, endeavors to bridge the gap between ignorance and knowledge of variety of listeners of Coimbatore through its multifarious shows. Radio Hub is the club under the hoods of PSG Community Radio 107.8MHz.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 53,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-21 01:41:19",
		"CID" : "rot",
		"CNAME" : "Rotaract Club",
		"CAT" : "club",
		"ABOUT" : "Rotaract club aims to \r\n•\tTo improve leadership qualities in the students by practicing the following.\r\n        o\t Leading a team and communicating the ideas with the members and implementing them. \r\n        o\t Organizing the events properly.\r\n        o\t Respecting others and helping others\r\n        o       Being honest, kind and humble \r\n        o       Completing the work on time with dedication\r\n•\tTo help and motivate the needy people through various ways.\r\n•\tTo nurture students’ love towards nature.\r\n•\tTo make students understand the importance of cleanliness in the surroundings.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 54,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-03-06 19:40:02",
		"CID" : "src",
		"CNAME" : "Student Research Council",
		"CAT" : "club",
		"ABOUT" : "Research gives students an unforgettable experience in their undergraduate life. Students’ Research focuses on using the knowledge gained by students through their course and the Unconventional thinking of the fresh and young minds, in creating innovations. This also facilitates better understanding of their subject, gives a hands-on experience and improves their presentation and communication skills. Students’ research can complement faculty research and lead to better outcomes useful to the Institution.\r\nPrimary Objectives \r\n1.\tTo increase the technical and research competence of students and channelize the outcomes of student research activities for the growth of the institution.\r\n2.\tTo act as a facilitator to faculty who are interested in identifying the right student to assist in their Research Projects and to students who are inspired by Research and are searching for the right project to work on.\r\n3.\tTo increase the number of contribution of students to Journals. Conferences, Technical Contests and Symposia.\r\n\r\nOther Objectives\r\n1.\tTo identify students with aspiration and skills and encourage them to move higher, such as giving them an opportunity to attend programmes in IITs.\r\n2.\tTo conduct thought provoking and technically challenging contests for students.\r\n3.\tTo co-ordinate with students’ union in forming core research group under various disciplines in engineering and science.\r\n4.\tTo organize more events to enhance the various skills like creativity, critical thinking, reengineering, redesigning etc., that induces the research activity.\r\n5.\tTo create awareness among the students’ about the several opportunities available for submitting their project ideas, innovative & creative ideas, business proposals, project proposals, marketing plans, design challenges etc., to government and private sectors.\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 55,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-21 00:19:37",
		"CID" : "tam",
		"CNAME" : "தமிழ் மன்றம்",
		"CAT" : "club",
		"ABOUT" : "'தமிழுக்கு இடமில்லா இடமொன்று இல்லையென்று தரணியிலே துறைதோறும் செயல் செய்வோம் தமிழுக்கும், தமிழாலே உலகுக்கும்' என்ற இனிய நோக்கம் கொண்டு இத்தொழில்நுட்ப கல்லூரியில் தமிழும் தமிழ் சார்ந்த இடமுமாக மகிழ்சிறந்து விளங்கி வரும் 'தமிழ்மன்றம்' எனும் பெயர்கொண்டு தமிழால் இணைந்து,தமிழோடு வளர்ந்து, தமிழுக்காய் வாழும் மாணவர் அமைப்பு!",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 56,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-24 10:08:35",
		"CID" : "tek",
		"CNAME" : "Tech Music",
		"CAT" : "club",
		"ABOUT" : "Tek Music is the official music club of PSG College of Technology. Our club has been providing melodious tunes and rhythms to several generations of Techians since 1952. We conduct a variety of shows throughout the academic year ranging from Indian classical music to contemporary Western styles. Apart from the numerous shows on campus, we also take our talent to many inter-college band competitions.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 57,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-01-07 19:41:26",
		"CID" : "wdc",
		"CNAME" : "Women Development Cell",
		"CAT" : "club",
		"ABOUT" : "Women Development Cell serves as a platform where female students can comfortably participate and share their views. WDC organizes events, workshops on gender amity, women’s welfare and to recognize individual efforts towards equality and empowerment. WDC creates awareness about health and hygiene among students and staff.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 58,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-09-27 02:39:33",
		"CID" : "yoc",
		"CNAME" : "Youth Outreach Club",
		"CAT" : "club",
		"ABOUT" : "The club aims at enriching the knowledge of PSG Sarvajana's Manavar Illam Students. The young students are trained in Personality Development, are guided in their higher education and mentored to find solutions to their problems. Students who themselves faced difficulties to cope up with the education at school level are the teachers here. The club is made official recently, after the students of \"ManavarIllam\" got top scores in public exams. Members of the club spend hours after college and on weekends to teach kids various subjects. The club also plans to extend their coaching activities to more schools in rural areas. The objective is to help kids with their learning and therefore they get chance in living a better life. This is the club where the members take responsibilities for the life of young children. Members of the club will go to Manavarillam every evening and teach subjects to the young minds who are to face their public examinations. The children at the Manavarillam have shown their enthusiasm for our interaction with them in the past years and we only expect to increase it in the fore coming years. Teaching is not the only thing that happens there, but our members also share valuable life experiences with the children and motivate them to overcome the hardships of their life. The members of the club also benefit from this experience. They learn to be more mature as they have been given the responsibility of guiding the next generation. They are assured to return home with pride and self satisfaction. However, the children at the Manavarillam teach a more valuable lesson to the members, “To appreciate life with what we have been blessed with and enjoy it”. \r\nAll this process was earlier happening under the banner “Outreach club”. After two years of success it has been taken to the next level. It has been officially made as the club with the name, “Youth Outreach Club”. The members have worked hard to make this happen. Recruitment is happening and the club is only growing bigger and better day by day. With more goals set, we club will function with at most efficacy in achieving the same.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 59,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2019-03-04 02:29:14",
		"CID" : "yrcs",
		"CNAME" : "Youth Red Cross Society",
		"CAT" : "club",
		"ABOUT" : "                   Youth represent a substantial part of the membership of Red Cross for its humanitarian commitment. Young volunteers can make a significant contribution to meeting the needs of the most vulnerable people within their local communities through Red Cross Youth programme.\r\n\r\nMISSION OF YOUTH RED CROSS\r\n•\tTo inculcate love and care among the Youth of our country. \r\n•\tAwareness on the care of their own health and that of others. \r\n•\tThe understanding and acceptance of civic responsibilities and acting accordingly with humanitarian concern and to fulfill the same. \r\n•\tTo enable the growth and development of a spirit of service and sense of duty with dedication and devotion in the minds of youth \r\n•\tTo foster better friendly relationship with all without any discrimination.\r\n\r\nVISION OF YOUTH RED CROSS \r\n\t\r\n•\tProtection of Health & Life \r\n•\tService to the Sick & Suffering \r\n•\tPromotion of national and international friendship to develop the mental and moral capabilities of youth. \r\n\r\n\r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 60,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "admin",
		"CNAME" : "Administrator",
		"CAT" : "admin",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 63,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "SU",
		"CNAME" : "Students Union",
		"CAT" : "",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 65,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "aa",
		"CNAME" : "Aeronautical Association",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 66,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "igbc",
		"CNAME" : "Indian Green Building Council",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 69,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : null,
		"CID" : "iims",
		"CNAME" : "Indian Institute of Metals",
		"CAT" : "assn",
		"ABOUT" : null,
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "0",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 73,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-27 23:24:36",
		"CID" : "iebms",
		"CNAME" : "IEEE EBMS Student Branch",
		"CAT" : "assn",
		"ABOUT" : "IEEE Engineering in Medicine and Biology Society (EMBS) Student Branch Chapter",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 74,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2022-01-24 09:41:38",
		"CID" : "airc",
		"CNAME" : "Artificial Intelligence & Robotics",
		"CAT" : "club",
		"ABOUT" : "We the AIR Club, aimed at empowering and enriching our understanding and knowledge by sharing it with our peers. \r\n\r\nArtificial Intelligence will surely become an irreplaceable part of our lives in the near future. Our club focuses on bringing this future closer to reality and our everyday lives. We are more than proud to inform you that our club is the First and Only technical club of the college that aims at spreading the knowledge that we possess in this field of technology. We as a team will work for the development and deployment of the Field of AI and Robotics by encouraging amazing and breath-taking ideas that can change the world.\r\nThe AIR club aims at providing top-notch opportunities for everyone to learn, dwell on and develop themselves. We have conducted various workshops, webinars, speeches, and competitions. We select various current topics from Artificial Intelligence, Machine learning, deep learning, and Robotics and conduct various events. We make sure that everyone gets to know about the field better and use it for their development and projects that are designed to meet future needs. \r\nWe as a team are working together for the development of many different projects and hands-on experience in the field of AI and robotics and are also keen on promoting and guiding the different ideas and knowledge pools of our peers. We also aim at providing our members with exposure to various new inventions in this field which makes the path to futuristic ideas easier and more comfortable.\r\nAIR club provides a platform for everyone to express their interests develop their skills and make themselves ready for the future world of innovative engineering. \r\n",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	},
	{
		"id" : 75,
		"dt_created" : "2022-07-08 08:26:39",
		"dt_modified" : "2021-01-09 14:12:38",
		"CID" : "amc",
		"CNAME" : "AeroModeling club",
		"CAT" : "club",
		"ABOUT" : "Aeromodelling club at PSG TECH is initiated to teach the students about the science and engineering principles of aviation. Aeromodelling is the activity involving design, development and flying of small air vehicles. It gives a very good understanding of the engineering and aviation skills that play a vital role in aircraft applications and provides enormous opportunities to develop, innovative, and implement aviation skills. The students are primarily trained on the basics of aviation systems which helps them understand the fundamental principles of design and development in an aviation system. In secondary level of training, the students will be taught and involved in design and simulation activities using commercially available softwares. In due course, the students will also be involved in real time construction of static models and flying of chuck gliders, control line models, and radio controlled models. The aeromodelling skills inculcated will in turn aid the students to take up real time challenges in the field of aviation system design and development.",
		"E_DESC" : null,
		"G_DESC" : null,
		"ABOUTFAPPR" : "1",
		"CON_MALE" : null,
		"CON_FEMALE" : null,
		"CON_MAIL" : null
	}
]
